---
kind: method
id: M:Autodesk.Revit.DB.ExportFontKey.#ctor
source: html/23f5a68b-ede1-e2d1-a293-a2cdc00d91ee.htm
---
# Autodesk.Revit.DB.ExportFontKey.#ctor Method

Constructs a new default ExportFontKey.

## Syntax (C#)
```csharp
public ExportFontKey()
```